{
    "basics": {
        "name": "Vedansh Kumar",
        "email": "vedansh21.2000@gmail.com",
        "phone": "06280431467",
        "photo": {
            "url": "https://cdn.rxresu.me/uploads/564783/645765/1696525112681.jpg",
            "filters": {
                "size": 134,
                "shape": "circle",
                "border": true,
                "grayscale": false
            },
            "visible": true
        },
        "summary": "🚀 Step into the realm of innovation, where I'm your vibrant developer armed with a robust skill set that spans Python, Unity (C#), IoT, Raspberry Pi, Arduino Uno, and the magical world of electronics. Picture this: a trail of successful AI projects showcasing classifiers, image detection marvels, and fraud detection wizardry. 🌐\n\n But wait, there's more in my toolbox! I wield seamless API integration like a wizard casting spells, perform automation feats with the finesse of a magician using Beautiful Soup and Selenium, and manage databases (think MongoDB, PostgreSQL, Kafka) like a symphony conductor leading a masterpiece.\n\n Now, let's talk about the future where chatbots become conversational maestros. I'm your guide in this journey, well-versed in RASA and NLP, ready to bring your interactions to life. And guess what? I'm not just grounded; I'm floating in the clouds too! AWS, GCP, IBM I navigate through the cloud like a digital explorer. 🤖☁️\n\n Hold on, did I forget to mention my crown? Yep, I'm a game development hackathon champion, where creativity and technical brilliance come together for a spectacular show. 🏆\n\n Feeling the spark yet? It's time to transform your ideas into reality. Let's collaborate, co-create, and conjure up something extraordinary! 🚀💡",
        "website": "",
        "headline": "### The Quieter you become , the more you'll be able to hear.",
        "location": {
            "city": "Pathankot",
            "region": "Punjab",
            "address": "Home No 120 Block 11 Shahpuri gate, Sujanpur, near Grace beauty parlour, Mahajan hall",
            "country": "India",
            "postalCode": "145023"
        },
        "profiles": [
            {
                "id": "81baba0d-d0eb-44e9-99b0-64ceff7c1451",
                "url": "https://www.linkedin.com/in/vedansh-kumar-27822410b/",
                "network": "LinkedIn",
                "username": "Vedansh Kumar"
            }
        ],
        "birthdate": "2001-03-21"
    },
    "work": {
        "id": "work",
        "name": "Work Experience",
        "type": "work",
        "items": [
            {
                "id": "Xebia",
                "title": "Xebia",
                "content": "#### *Gurugram, India*\n#### *Xebia is a worldwide, innovative IT Consultancy Company, operating on a global scale*\n- Worked on blockchain projects\n- Worked on creating Smart Contracts for Thought Machine\n- Working on Kafka streaming, system design\n- Worked on Spring Boot, Microservices, REST Framework\n- Worked on MongoDB",
                "technologies": [
                    "Blockchain",
                    "Smart Contracts",
                    "Kafka",
                    "Spring Boot",
                    "Microservices",
                    "REST Framework",
                    "MongoDB"
                ],
                "buttons": [
                    {
                        "text": "Xebia",
                        "class": "btn_one"
                    }
                ]
            },
            {
                "id": "Packt",
                "title": "Packt",
                "content": "#### *Online U.S.A* \n- Designed an NLU chatbot using RASA for real-time COVID-19 updates, tailored for Indian data\n##### *Achievements/Tasks*\n- Leadership: Led a team of interns, fostering a collaborative environment and facilitating skill development.\n- Project Management: Conducted daily stand-up meetings to track project progress and address any issues promptly.\n- Delivery: Delivered the project on time, demonstrating effective project management and leadership skills.\n- Recognition: Recognized for delivering the best project in the given timeframe, reflecting commitment and efficiency.\n",
                "technologies": [
                    "NLU Chatbot",
                    "RASA",
                    "Leadership",
                    "Project Management"
                ],
                "buttons": [
                    {
                        "text": "Packt",
                        "class": "btn_one"
                    }
                ]
            },
            {
                "id": "CIACON",
                "title": "CIACON",
                "content": "#### *Online Delhi, India*\n- Spearheaded the development of a Capture The Flag (CTF) game for an international event that engaged ethical hackers globally.\n- Leveraged Unity Engine and Photon Multiplayer to create a real-time and seamless gaming experience.\n- Solo Developer",
                "technologies": [
                    "Capture The Flag (CTF) Game",
                    "Unity Engine",
                    "Photon Multiplayer"
                ],
                "buttons": [
                    {
                        "text": "CIACON",
                        "class": "btn_one"
                    }
                ]
            },
            {
                "id": "Variety Innovation",
                "title": "Variety Innovation",
                "content": "#### *Gurugram, India*\n- Executed tasks related to robotics and collaborative robots (cobots) within the company.\n- Successfully programmed a robot for precision cutting, ensuring accuracy and efficiency in the manufacturing process.\n- Worked extensively with 3D objects, applying Solidworks 3D for design and modeling.\n- Collaborated with cross-functional teams to integrate robotic solutions into various projects.\n",
                "technologies": [
                    "Robotics",
                    "Collaborative Robots (Cobots)",
                    "Solidworks 3D"
                ],
                "buttons": [
                    {
                        "text": "Variety Innovation",
                        "class": "btn_one"
                    }
                ]
            }
        ]
    },
    "projects": {
        "id": "projects",
        "name": "Projects",
        "type": "basic",
        "items": [
            {
                "id": "11893485-ad8b-48e6-a64f-aa9f8012a3fa",
                "url": "",
                "date": {
                    "end": "2020-06-20",
                    "start": "2020-06-01"
                },
                "name": "IchiBOt",
                "summary": "- Acquired proficiency in AIML syntax through independent learning and self-directed study.\n- Implemented AIML markup language effectively to ensure accurate and contextually relevant responses.\n- Deployed on Telegram + self hosted server",
                "keywords": [],
                "description": "Developed and deployed a versatile AIML-powered Chatbot, excelling in dynamic conversations on diverse subjects."
            },
            {
                "id": "2663a141-d18e-49ed-bfc9-cd6df86761e9",
                "url": "",
                "date": {
                    "end": "2019-11-20",
                    "start": "2019-10-30"
                },
                "name": "Indian Sign Language Interpreter",
                "summary": "\n- Developed an innovative ISL (Indian Sign Language) interpreter utilizing machine learning techniques.\n- Implemented Python, Tensorflow, and OpenCV to build a robust model for converting Sign Language to text and speech, and vice-versa.\n- Successfully showcased the first prototype of the project at the prestigious Innovation Punjab Summit in 2019.\n\nSkills\n -  Programming Languages: Python\n -  Machine Learning Frameworks: Tensorflow\n\nKey Achievements\n- Innovation Punjab Summit 2019 Showcase\n  - Presented the initial prototype of the ISL Interpreter project at a prominent technology and innovation event.\n  - Demonstrated the project's potential to bridge communication gaps for individuals using Indian Sign Language.\n",
                "keywords": [],
                "description": "A Sign Language Interpreter for Mute or Deaf People"
            },
            {
                "id": "88dfbc7d-fdff-4501-a846-6d89120067fd",
                "url": "",
                "date": {
                    "end": "2020-08-01",
                    "start": "2020-06-01"
                },
                "name": "The Useless Game",
                "summary": "Game Development | Unity\n- Designed and developed \"The Useless Game,\" a 2D mobile game using the Unity game engine.\n- Served as a valuable learning and testing project, contributing to skill enhancement in game development.\n- Gained hands-on experience in Unity's 2D game development features.\n\nKey Achievements\n- The Useless Game\n  - Conceptualized and implemented a mobile game from ideation to deployment.\n  - Demonstrated proficiency in Unity's 2D game development environment.\n  - Acquired practical insights into game design principles and development workflows.\n\nSkills\n- Game Development: Unity\n- Game Design 2D Game Development\n- Mobile Platforms: Android",
                "keywords": [],
                "description": "\"Embark on a playful journey with 'The Useless Game,' an Android adventure blending simplicity with innovation, all crafted through the lens of a learning game development experience.\""
            }
        ],
        "columns": 1,
        "visible": true
    }
}